18-rails-auth/best_kept_secret/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save
---
INSERT INTO "users" ("username", "secret", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def index
    if current_user.admin == true
      @users = User.all
    else
      @users = User.all.select{|user| user.admin != true}
---
SELECT "users".* FROM "users"

  def edit
    authorized_for(params[:id])
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "users" SET "secret" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["secret", "I don't like bread"], ["updated_at", "2019-05-09 10:07:52.854946"], ["id", 22]]